-------------------------------------------------------------------------------------------------------------------------------
      name:  labour_pset4_Po_Jui_Huang
       log:  C:\Users\user0522\Documents\GitHub\predoc-coding-sample-Po-Jui-Huang\labour_pset4_Po-Jui_Huang.log
  log type:  text
 opened on:  14 Nov 2025, 00:08:26

. 
. /*import data*/
. use ".\code_python_stata\ec423ps4\ec423ps4\nlsy_2014_data.dta", clear

. 
. /*3*/
. // a, b
. sum hrp1 if hrp1 > 0, detail

                HRLY RATE OF PAY JOB# 1 2014
-------------------------------------------------------------
      Percentiles      Smallest
 1%          137              3
 5%          673              7
10%          850              9       Obs               5,342
25%         1225             10       Sum of wgt.       5,342

50%       1912.5                      Mean           2634.481
                        Largest       Std. dev.      3841.598
75%         3000          67620
90%         4615          76923       Variance       1.48e+07
95%         6250         101923       Skewness       13.68914
99%        14903         110000       Kurtosis       289.1297

. sum hrp2 if hrp2 > 0, detail

                HRLY RATE OF PAY JOB# 2 2014
-------------------------------------------------------------
      Percentiles      Smallest
 1%           96             20
 5%          357             25
10%          600             28       Obs               1,194
25%          900             32       Sum of wgt.       1,194

50%       1371.5                      Mean             2439.5
                        Largest       Std. dev.      7440.728
75%         2400          68681
90%         3846          93607       Variance       5.54e+07
95%         5600          96153       Skewness       18.00009
99%        17441         192307       Kurtosis       401.8632

. // c
. gen ln_hr_wage = ln(hrp1)
(1,729 missing values generated)

. histogram ln_hr_wage, xtitle("log of the hourly pay of job #1") title("Distribution of the log of the hourly pay of job #1.")
(bin=37, start=1.0986123, width=.28404387)

. graph save "Graph" ".\hist_ln_hrpay.png", replace
file .\hist_ln_hrpay.png saved as .gph format

. 
. /*4*/
. // a
. sum sampweight, detail

                    SAMPLING WEIGHT 2014
-------------------------------------------------------------
      Percentiles      Smallest
 1%        87884          56749
 5%       107277          59474
10%       122481          62789       Obs               7,071
25%       172793          65671       Sum of wgt.       7,071

50%       412156                      Mean           474607.7
                        Largest       Std. dev.        316190
75%       733119        1531660
90%       873935        1543993       Variance       1.00e+11
95%       985278        1576452       Skewness       .4113341
99%      1216073        1603933       Kurtosis       2.036322

. replace sampweight = sampweight/100
(7,071 real changes made)

. // b
. tabstat sampweight, by(id)

Summary for variables: sampweight
Group variable: id (SAMPLE ID  79 INT)

              id |      Mean
-----------------+----------
CROSS MALE WHITE |  8191.126
CROSS MALE WH. P |  7546.049
CROSS MALE BLACK |  2412.679
CROSS MALE HISPA |  1852.285
CROSS FEMALE WHI |  7333.102
CROSS FEMALE WH  |   7476.96
CROSS FEMALE BLA |  2077.065
CROSS FEMALE HIS |  1567.901
  SUP MALE BLACK |  2093.414
SUP MALE HISPANI |  1602.854
SUP FEMALE BLACK |   1936.04
SUP FEMALE HISPA |   1455.57
  MIL MALE WHITE |  4696.837
  MIL MALE BLACK |  4020.236
MIL MALE HISPANI |  4588.975
MIL FEMALE WHITE |   5122.65
MIL FEMALE BLACK |  4433.063
MIL FEMALE HISPA |  5254.065
-----------------+----------
           Total |  4746.077
----------------------------

. 
. /*5*/
. // a
. tab q3_4, label

HGHST GRADE/YR COMPLTD & |
         GOT CREDIT 2014 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                      -2 |          3        0.04        0.04
                      -1 |          3        0.04        0.08
               2ND GRADE |          3        0.04        0.13
               3RD GRADE |          9        0.13        0.25
               4TH GRADE |         12        0.17        0.42
               5TH GRADE |          7        0.10        0.52
               6TH GRADE |         29        0.41        0.93
               7TH GRADE |         29        0.41        1.34
               8TH GRADE |        100        1.41        2.76
               9TH GRADE |        166        2.35        5.11
              10TH GRADE |        256        3.62        8.73
              11TH GRADE |        411        5.81       14.54
              12TH GRADE |      2,878       40.70       55.24
        1ST YEAR COLLEGE |        414        5.85       61.09
        2ND YEAR COLLEGE |        875       12.37       73.47
        3RD YEAR COLLEGE |        198        2.80       76.27
        4TH YEAR COLLEGE |        974       13.77       90.04
        5TH YEAR COLLEGE |        111        1.57       91.61
        6TH YEAR COLLEGE |        328        4.64       96.25
        7TH YEAR COLLEGE |         69        0.98       97.23
8TH YEAR COLLEGE OR MORE |        188        2.66       99.89
                UNGRADED |          8        0.11      100.00
-------------------------+-----------------------------------
                   Total |      7,071      100.00

. tab q3_4, nolabel

      HGHST |
   GRADE/YR |
  COMPLTD & |
 GOT CREDIT |
       2014 |      Freq.     Percent        Cum.
------------+-----------------------------------
         -2 |          3        0.04        0.04
         -1 |          3        0.04        0.08
          2 |          3        0.04        0.13
          3 |          9        0.13        0.25
          4 |         12        0.17        0.42
          5 |          7        0.10        0.52
          6 |         29        0.41        0.93
          7 |         29        0.41        1.34
          8 |        100        1.41        2.76
          9 |        166        2.35        5.11
         10 |        256        3.62        8.73
         11 |        411        5.81       14.54
         12 |      2,878       40.70       55.24
         13 |        414        5.85       61.09
         14 |        875       12.37       73.47
         15 |        198        2.80       76.27
         16 |        974       13.77       90.04
         17 |        111        1.57       91.61
         18 |        328        4.64       96.25
         19 |         69        0.98       97.23
         20 |        188        2.66       99.89
         95 |          8        0.11      100.00
------------+-----------------------------------
      Total |      7,071      100.00

. // b
. gen yschl = q3_4 if q3_4 > 0
(6 missing values generated)

. replace yschl = 0 if yschl == 0
(0 real changes made)

. tab yschl

      yschl |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          3        0.04        0.04
          3 |          9        0.13        0.17
          4 |         12        0.17        0.34
          5 |          7        0.10        0.44
          6 |         29        0.41        0.85
          7 |         29        0.41        1.26
          8 |        100        1.42        2.68
          9 |        166        2.35        5.02
         10 |        256        3.62        8.65
         11 |        411        5.82       14.47
         12 |      2,878       40.74       55.20
         13 |        414        5.86       61.06
         14 |        875       12.38       73.45
         15 |        198        2.80       76.25
         16 |        974       13.79       90.04
         17 |        111        1.57       91.61
         18 |        328        4.64       96.25
         19 |         69        0.98       97.23
         20 |        188        2.66       99.89
         95 |          8        0.11      100.00
------------+-----------------------------------
      Total |      7,065      100.00

. 
. /*6*/
. // a
. gen age = 114 - dob_year //(2014 - birth year)

. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         49 |          1        0.01        0.01
         50 |        802       11.34       11.36
         51 |        991       14.01       25.37
         52 |        995       14.07       39.44
         53 |        978       13.83       53.27
         54 |        973       13.76       67.03
         55 |        822       11.62       78.66
         56 |        755       10.68       89.34
         57 |        752       10.63       99.97
         58 |          1        0.01       99.99
         59 |          1        0.01      100.00
------------+-----------------------------------
      Total |      7,071      100.00

. // b
. gen agesq = age^2

. // c
. gen mom_schl = hgc_mother

. gen pop_schl = hgc_father

. svyset [pw = sampweight]

Sampling weights: sampweight
             VCE: linearized
     Single unit: missing
        Strata 1: <one>
 Sampling unit 1: <observations>
           FPC 1: <zero>

. svy: mean mom_schl pop_schl
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      7,071
Number of PSUs   = 7,071          Population size = 33,559,507
                                  Design df       =      7,070

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    mom_schl |   10.86692    .056948      10.75528    10.97855
    pop_schl |   10.38291   .0740802      10.23769    10.52813
--------------------------------------------------------------

. mean mom_schl pop_schl [pweight=sampweight ]

Mean estimation                          Number of obs = 7,071

--------------------------------------------------------------
             |       Mean   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
    mom_schl |   10.86692    .056948      10.75528    10.97855
    pop_schl |   10.38291   .0740802      10.23769    10.52813
--------------------------------------------------------------

. // d
. tab sex

SEX OF R 79 |      Freq.     Percent        Cum.
------------+-----------------------------------
       MALE |      3,405       48.15       48.15
     FEMALE |      3,666       51.85      100.00
------------+-----------------------------------
      Total |      7,071      100.00

. tab sex, nolabel

SEX OF R 79 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,405       48.15       48.15
          2 |      3,666       51.85      100.00
------------+-----------------------------------
      Total |      7,071      100.00

. gen female = sex == 2

. svy: mean yschl , over(female)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      7,065
Number of PSUs   = 7,065            Population size = 33,529,165
                                    Design df       =      7,064

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
c.yschl@female |
            0  |    13.5655   .0780434      13.41251    13.71848
            1  |   13.79385   .0622525      13.67181    13.91588
----------------------------------------------------------------

. mean yschl  [pweight=sampweight ], over(female)

Mean estimation                            Number of obs = 7,065

----------------------------------------------------------------
               |       Mean   Std. err.     [95% conf. interval]
---------------+------------------------------------------------
c.yschl@female |
            0  |    13.5655   .0780434      13.41251    13.71848
            1  |   13.79385   .0622525      13.67181    13.91588
----------------------------------------------------------------

. // e
. //(1) use correlate with aweights for point estimates of the correlation.
. //(2) use svy: regress for p-values. Do svy: regress y x and svy: regress x y and take the biggest p-value, which is the cons
> ervative thing to do.
. corr yschl mom_schl pop_schl [aw = sampweight]
(sum of wgt is 33,529,164.690674)
(obs=7,065)

             |    yschl mom_schl pop_schl
-------------+---------------------------
       yschl |   1.0000
    mom_schl |   0.2486   1.0000
    pop_schl |   0.2677   0.4719   1.0000


. quietly svy: reg yschl mom_schl

. eststo kid_mom

. quietly svy: reg mom_schl yschl

. eststo mom_kid

. quietly svy: reg yschl pop_schl

. eststo kid_pop

. quietly svy: reg pop_schl yschl

. eststo pop_kid

. esttab

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                    yschl        mom_schl           yschl        pop_schl   
----------------------------------------------------------------------------
mom_schl            0.219***                                                
                  (18.36)                                                   

yschl                               0.283***                        0.404***
                                   (5.00)                          (5.19)   

pop_schl                                            0.177***                
                                                  (24.81)                   

_cons               11.30***        7.002***        11.84***        4.856***
                  (83.18)          (9.12)        (146.55)          (4.61)   
----------------------------------------------------------------------------
N                    7065            7065            7065            7065   
----------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. est clear

. // f
. gen afqt = afqt_3/1000 if afqt_3 > 0
(305 missing values generated)

. // g
. tab q11_5a

    R HAVE HEALTH LIMITATIONS? |
                          2014 |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                            -4 |          2        0.03        0.03
0: 0  CONDITION DOES NOT APPLY |      5,305       75.02       75.05
       1: 1  CONDITION APPLIES |      1,764       24.95      100.00
-------------------------------+-----------------------------------
                         Total |      7,071      100.00

. gen health_problem = q11_5a == 1

. tab health_problem

health_prob |
        lem |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,307       75.05       75.05
          1 |      1,764       24.95      100.00
------------+-----------------------------------
      Total |      7,071      100.00

. 
. /*7*/
. // a
. eststo: quietly regress ln_hr_wage yschl [pweight = sampweight], r
(est1 stored)

. // b
. eststo: quietly regress ln_hr_wage yschl female age agesq mom_schl pop_schl [pweight = sampweight], r
(est2 stored)

. // c
. eststo: quietly regress ln_hr_wage yschl female age agesq afqt [pweight = sampweight], r
(est3 stored)

. // d
. eststo: quietly regress ln_hr_wage yschl female age agesq afqt health_problem [pweight = sampweight], r
(est4 stored)

. // e
. eststo: quietly regress ln_hr_wage i.yschl female age agesq afqt [pweight = sampweight], r
(est5 stored)

. eststo: quietly regress ln_hr_wage i.yschl female age agesq afqt if yschl >= 8 [pweight = sampweight], r
(est6 stored)

. xi i.yschl
i.yschl           _Iyschl_2-95        (naturally coded; _Iyschl_2 omitted)

. eststo: quietly regress ln_hr_wage ib12.yschl female age agesq afqt if yschl >= 8 [pweight = sampweight], r
(est7 stored)

. // f
. esttab using ".\reg_result.tex", cell("b" "se") replace
(output written to .\reg_result.tex)

. est clear

. 
. /*=================================*/
. log close labour_pset4_Po_Jui_Huang
      name:  labour_pset4_Po_Jui_Huang
       log:  C:\Users\user0522\Documents\GitHub\predoc-coding-sample-Po-Jui-Huang\labour_pset4_Po-Jui_Huang.log
  log type:  text
 closed on:  14 Nov 2025, 00:08:28
-------------------------------------------------------------------------------------------------------------------------------
